# TAPS
# ----------------------------------
tap "azure/kubelogin"



# FORMULAS
# ---------------------------------
brew "openssl@3"
brew "azure-cli"
brew "bash"
brew "bat"
brew "witr"
brew "cloc"
brew "qemu"
brew "colima"
brew "coreutils"
brew "diff-so-fancy"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "duti"
brew "entr"
brew "rubberband"
brew "ffmpeg-full", link: true
brew "fluid-synth"
brew "fzf"
brew "gifski"
brew "git"
brew "gnupg"
brew "go"
brew "imagemagick-full", link: true
brew "jenv"
brew "jq"
brew "kubernetes-cli"
brew "kubeseal"
brew "libpq", link: true
brew "maven"
brew "ruby-install"
brew "chruby"
brew "nvm"
brew "p7zip"
brew "tree"
brew "pass"
brew "pinentry-mac"
brew "pipx"
brew "poppler"
brew "pspg"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qpdf"
brew "rust"
brew "unar"
brew "wget"
brew "yarn"
brew "pnpm"
brew "yt-dlp"
brew "azure/kubelogin/kubelogin"
brew "typst"
brew "pandoc"
brew "pastel"


# CASKS
# ---------------------------------

# Base
cask "iterm2"
cask "keepingyouawake"
cask "sublime-text"

# Remote storage
cask "google-drive"
cask "cyberduck"

# Leisure
cask "openemu"

# Fonts
cask "font-agave-nerd-font"
cask "font-iosevka-charon-mono"  # https://github.com/jul-sh/iosevka-charon
cask "font-datatype"             # https://franktisellano.github.io/datatype/

# Browsing
cask "google-chrome"
cask "firefox"

# Messaging
cask "messenger"
cask "signal"
cask "discord"

# Media
cask "spotify"
cask "aural"
cask "stolendata-mpv"
cask "loopback"
cask "audacity"

# Development
cask "graalvm-jdk"
cask "temurin"
cask "temurin@11"
cask "temurin@17"
cask "temurin@21"
cask "zulu@8"
cask "keystore-explorer"
cask "tailscale-app"
cask "bruno"
cask "miro"
cask "intellij-idea-ce"
cask "vscodium"

# Utils
cask "qlmarkdown"
